testCase/counterFlowFlame2D/0.org/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    fuel
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
-6.58534e-08
-6.58534e-08
-6.58534e-08
-6.58534e-08
-6.58534e-08
-6.58534e-08
-6.58534e-08
-6.58534e-08
...
)
;
    }
    air
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
-1.18382e-07
-1.18382e-07
-1.18382e-07
-1.18382e-07
-1.18382e-07
-1.18382e-07
-1.18382e-07
-1.18382e-07
...
)
;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
