testCase/counterFlowFlame2D/constant/newMesh/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    fuel
    {
        type            patch;
        nFaces          400;
        startFace       22800;
    }
    air
    {
        type            patch;
        nFaces          400;
        startFace       23200;
    }
    outlet
    {
        type            patch;
        nFaces          800;
        startFace       23600;
    }
    frontAndBack
    {
        type            patch;
        nFaces          800;
        startFace       24400;
    }
)

// ************************************************************************* //
